# success messages

ACCEPT_PRIVACY_POLICE = 'Продолжая, вы принимаете пользовательское соглашение и политику конфидициальности.'
SEND_LOCATION = 'Отправить мои координаты'
OK_TO_CONTINUE = 'Чтобы продолжить, значение должно быть "Ok"'
WHAT_YOUR_NAME = 'Как тебя зовут?'
HOW_OLD_YOU = 'Сколько тебе лет?'
WHAT_YOUR_GENDER = 'Какой у тебя пол?'
ABOUT_YOU = 'Расскажи о себе'
WHERE_YOU_FROM = 'Из какого ты города?'
SEND_YOUR_PHOTO = 'Теперь пришли своё фото, его будут видеть другие пользователи'
REGISTER_IS_OVER = 'Регистрация завершена!'
MUST_SEND_PHOTO = 'Отправьте фото'

# validation error messages

NAME_CAN_CONTAIN_LETTERS = 'Имя может содержать только буквы'
TOO_LONG_NAME = 'Не бывает такого длинного имени'
TOO_SHORT_NAME = 'Вас назвали буквой? Поправьте имя'
NAME_CANT_CONTAIN_SPACES = 'Имя не может содержать пробелы, уберите их'
NAME_BEGIN_CANT_BE_LOWER = 'Уважайте себя, напишите своё имя с большой буквы'
AGE_MUST_BE_INT = 'Возраст должен быть числом'
AGE_LESS_ZERO = 'Вы не можете быть настолько молодыми, число должно быть положительным'
TOO_BIG_AGE = 'Леее, врятли вам 200+ лет'
WRONG_GENDER = 'Леее, пол должен быть или "Парень", или "Девушка", третьего не дано'